-- Для pgAdmin: сначала создайте БД university вручную, потом выполните этот скрипт

DROP TABLE IF EXISTS students;
DROP TABLE IF EXISTS groups;

CREATE TABLE groups (
    id SERIAL PRIMARY KEY,
    number VARCHAR(10) NOT NULL,
    major VARCHAR(255) NOT NULL,
    start_year INT NOT NULL,
    grad_year INT NOT NULL
);

CREATE TABLE students (
    id SERIAL PRIMARY KEY,
    group_id INT NOT NULL,
    full_name VARCHAR(255) NOT NULL,
    gender VARCHAR(1) NOT NULL CHECK (gender IN ('М', 'Ж')),
    birth_date DATE NOT NULL,
    student_card_number VARCHAR(20) NOT NULL,
    subgroup SMALLINT DEFAULT 1,
    FOREIGN KEY (group_id) REFERENCES groups(id) ON DELETE CASCADE
);

-- Две подгруппы
INSERT INTO groups (number, major, start_year, grad_year) VALUES
('305(1)', '09.03.04 Программная инженерия', 2023, 2027),
('305(2)', '09.03.04 Программная инженерия', 2023, 2027);

INSERT INTO students (group_id, full_name, student_card_number, gender, birth_date, subgroup) VALUES
(1, 'Зубков Роман Сергеевич', '231544', 'М', '2005-05-12', 1),
(1, 'Иванов Максим Александрович', '231553', 'М', '2005-03-15', 1),
(1, 'Ивенин Артём Андреевич', '230274', 'М', '2005-07-20', 1),
(1, 'Кочнев Артем Алексеевич', '231554', 'М', '2005-09-05', 1),
(1, 'Логунов Илья Сергеевич', '231551', 'М', '2005-11-23', 1),
(1, 'Макарова Юлия Сергеевна', '231540', 'Ж', '2005-04-18', 1),
(1, 'Маскинскова Наталья Сергеевна', '231536', 'Ж', '2005-06-30', 1),
(1, 'Мукасеев Дмитрий Александрович', '230026', 'М', '2005-08-14', 1),
(1, 'Наумкин Владислав Валерьевич', '231532', 'М', '2005-10-02', 1),
(1, 'Томилин Илья Петрович', '220325', 'М', '2005-04-05', 1),
(1, 'Рыбаков Евгений Геннадьевич', '231550', 'М', '2005-09-29', 1),
(1, 'Шушев Денис Сергеевич', '231969', 'М', '2005-01-30', 1),
(2, 'Казейкин Иван Иванович', '231527', 'М', '2005-01-10', 2),
(2, 'Маклаков Сергей Александрович', '240021', 'М', '2005-02-27', 2),
(2, 'Паркаев Василий Александрович', '231533', 'М', '2005-12-12', 2),
(2, 'Полковников Дмитрий Александрович', '231556', 'М', '2005-01-25', 2),
(2, 'Пузаков Дмитрий Александрович', '231537', 'М', '2005-03-08', 2),
(2, 'Пшеницына Полина Алексеевна', '231523', 'Ж', '2005-05-19', 2),
(2, 'Пяткин Игорь Алексеевич', '231525', 'М', '2005-07-07', 2),
(2, 'Рыжкин Владислав Дмитриевич', '231538', 'М', '2005-11-01', 2),
(2, 'Рябченко Александра Станиславовна', '231518', 'Ж', '2005-02-14', 2),
(2, 'Тульсков Илья Андреевич', '231531', 'М', '2005-06-22', 2),
(2, 'Фирстов Артём Александрович', '231545', 'М', '2005-08-30', 2),
(2, 'Четайкин Владислав Александрович', '240022', 'М', '2005-10-15', 2),
(2, 'Шарунов Максим Игоревич', '231528', 'М', '2005-12-05', 2);
